Revit 2024 API
AnalysisDisplayLegend.Height Property
 The height, in sheet size, of the legend's rectangle
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double Height { get; set; }
Visual Basic
Public Property Height As Double
	Get
	Set
Visual C++
public:
property double Height {
	double get ();
	void set (double value);
}
See Also
AnalysisDisplayLegend Class
Autodesk.Revit.DB.Analysis Namespace